In [124]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', None)
%matplotlib inline
import plotly
import plotly.graph_objs as go
import plotly.tools as tls
import seaborn as sns
import time
from datetime import datetime
import warnings

warnings.filterwarnings('ignore')
# plotly
# seaborn
# pandas-profiling

In [24]:
temp_city = pd.read_csv('./input/GlobalLandTemperaturesByCity.csv')
temp_country = pd.read_csv('./input/GlobalLandTemperaturesByCountry.csv')
temp_global = pd.read_csv('./input/GlobalTemperatures.csv')
#temp_city = pd.read_csv('./input/GlobalLandTemperaturesByCity.csv')

In [109]:
temp_city = temp_city[temp_city['AverageTemperature'].notna()]

In [27]:
temp_city['dt'] = pd.to_datetime(temp_city['dt'], dayfirst=True)

In [28]:
temp_city['year'] = temp_city['dt'].dt.year
temp_city['month'] = temp_city['dt'].dt.month
temp_city.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month
0,1743-11-01,6.07,1.74,Århus,Denmark,57.05N,10.33E,1743,11
5,1744-04-01,5.79,3.62,Århus,Denmark,57.05N,10.33E,1744,4
6,1744-05-01,10.64,1.28,Århus,Denmark,57.05N,10.33E,1744,5
7,1744-06-01,14.05,1.35,Århus,Denmark,57.05N,10.33E,1744,6
8,1744-07-01,16.08,1.40,Århus,Denmark,57.05N,10.33E,1744,7

In [29]:
temp_city.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8235082 entries, 0 to 8599210
Data columns (total 9 columns):
 #   Column                         Dtype
---  ------                         -----
 0   dt                             datetime64[ns]
 1   AverageTemperature             float64
 2   AverageTemperatureUncertainty  float64
 3   City                           object
 4   Country                        object
 5   Latitude                       object
 6   Longitude                      object
 7   year                           int64
 8   month                          int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 628.3+ MB

In [30]:
temp_city.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8235082 entries, 0 to 8599210
Data columns (total 9 columns):
 #   Column                         Dtype
---  ------                         -----
 0   dt                             datetime64[ns]
 1   AverageTemperature             float64
 2   AverageTemperatureUncertainty  float64
 3   City                           object
 4   Country                        object
 5   Latitude                       object
 6   Longitude                      object
 7   year                           int64
 8   month                          int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 628.3+ MB

In [31]:
temp_city.Country.value_counts()

India               960548
China               819132
United States       661524
Brazil              451645
Russia              448663
                     ...
Burundi               1675
Eritrea               1669
Djibouti              1658
Oman                  1652
Papua New Guinea      1580
Name: Country, Length: 159, dtype: int64

In [32]:
temp_city.shape

(8235082, 9)

In [33]:
temp_city.isna().sum()

dt                               0
AverageTemperature               0
AverageTemperatureUncertainty    0
City                             0
Country                          0
Latitude                         0
Longitude                        0
year                             0
month                            0
dtype: int64

In [34]:
np.set_printoptions(suppress=True)

In [35]:
temp_city.head(5)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month
0,1743-11-01,6.07,1.74,Århus,Denmark,57.05N,10.33E,1743,11
5,1744-04-01,5.79,3.62,Århus,Denmark,57.05N,10.33E,1744,4
6,1744-05-01,10.64,1.28,Århus,Denmark,57.05N,10.33E,1744,5
7,1744-06-01,14.05,1.35,Århus,Denmark,57.05N,10.33E,1744,6
8,1744-07-01,16.08,1.40,Århus,Denmark,57.05N,10.33E,1744,7

In [36]:
temp_city.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8235082 entries, 0 to 8599210
Data columns (total 9 columns):
 #   Column                         Dtype
---  ------                         -----
 0   dt                             datetime64[ns]
 1   AverageTemperature             float64
 2   AverageTemperatureUncertainty  float64
 3   City                           object
 4   Country                        object
 5   Latitude                       object
 6   Longitude                      object
 7   year                           int64
 8   month                          int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 628.3+ MB

In [37]:
temp_city.describe()

       AverageTemperature  AverageTemperatureUncertainty       year      month
count          8235082.00                     8235082.00 8235082.00 8235082.00
mean                16.73                           1.03    1910.83       6.49
std                 10.35                           1.13      64.20       3.45
min                -42.70                           0.03    1743.00       1.00
25%                 10.30                           0.34    1865.00       3.00
50%                 18.83                           0.59    1915.00       6.00
75%                 25.21                           1.35    1964.00       9.00
max                 39.65                          15.40    2013.00      12.00

In [38]:
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [39]:
temp_city['temp_top'] = temp_city['AverageTemperature'] + temp_city['AverageTemperatureUncertainty']
temp_city['temp_bottom'] = temp_city['AverageTemperature'] - temp_city['AverageTemperatureUncertainty']

In [40]:
temp_city.Country.value_counts()

India               960548
China               819132
United States       661524
Brazil              451645
Russia              448663
                     ...
Burundi               1675
Eritrea               1669
Djibouti              1658
Oman                  1652
Papua New Guinea      1580
Name: Country, Length: 159, dtype: int64

In [41]:
from pandas_profiling import ProfileReport

In [43]:
profile = ProfileReport(temp_city, title="Pandas Profiling Report", explorative=True)

TypeError: describe_date_1d() got an unexpected keyword argument 'title'

In [46]:
gr = temp_city[temp_city['Country'] == 'Greece']

In [47]:
gr.describe()

,AverageTemperature,AverageTemperatureUncertainty,year,month,temp_top,temp_bottom
count,21752.00,21752.00,21752.00,21752.00,21752.00,21752.00
mean,16.35,1.43,1883.55,6.49,17.78,14.92
std,6.64,1.32,74.98,3.45,6.58,6.95
min,-2.28,0.05,1743.00,1.00,-1.67,-11.08
25%,11.12,0.43,1819.00,3.00,12.62,9.55
50%,16.17,0.94,1884.00,6.00,17.67,14.96
75%,22.56,2.06,1948.00,9.00,23.72,21.13
max,30.12,9.57,2013.00,12.00,34.50,28.65

In [110]:
gr = gr[gr['AverageTemperature'].notna()]

gr.info()

In [49]:
gr.City.value_counts()

Thessaloníki    3166
Lárisa          3166
Pátrai          3160
Kallithéa       3128
Peristérion     3128
Athens          3128
Iráklion        2876
Name: City, dtype: int64

In [50]:
gr['year'] = gr['dt'].split('-')[0]

AttributeError: 'Series' object has no attribute 'split'

In [52]:
temp_country = temp_country[temp_country['AverageTemperature'].notna()]

In [53]:
temp_country.Country.value_counts()

Austria                                3166
Macedonia                              3166
Croatia                                3166
Sweden                                 3166
Montenegro                             3166
                                       ...
Federated States Of Micronesia         1364
Guam                                   1328
Northern Mariana Islands               1328
French Southern And Antarctic Lands     783
Heard Island And Mcdonald Islands       783
Name: Country, Length: 242, dtype: int64

In [54]:
temp_country['dt'] = pd.to_datetime(temp_country['dt'], dayfirst=True)
temp_country['year'] = temp_country['dt'].dt.year
temp_country['month'] = temp_country['dt'].dt.month
temp_country.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year,month
0,1743-11-01,4.38,2.29,Åland,1743,11
5,1744-04-01,1.53,4.68,Åland,1744,4
6,1744-05-01,6.70,1.79,Åland,1744,5
7,1744-06-01,11.61,1.58,Åland,1744,6
8,1744-07-01,15.34,1.41,Åland,1744,7

In [55]:
temp_global = temp_global[temp_global['LandMaxTemperature'].notna()]
temp_global['dt'] = pd.to_datetime(temp_global['dt'], dayfirst=True)
temp_global['year'] = temp_global['dt'].dt.year
temp_global['month'] = temp_global['dt'].dt.month
temp_global.head()

,dt,LandAverageTemperature,LandAverageTemperatureUncertainty,LandMaxTemperature,LandMaxTemperatureUncertainty,LandMinTemperature,LandMinTemperatureUncertainty,LandAndOceanAverageTemperature,LandAndOceanAverageTemperatureUncertainty,year,month
1200,1850-01-01,0.75,1.10,8.24,1.74,-3.21,2.82,12.83,0.37,1850,1
1201,1850-02-01,3.07,1.27,9.97,3.01,-2.29,1.62,13.59,0.41,1850,2
1202,1850-03-01,4.95,0.95,10.35,2.40,-1.91,1.41,14.04,0.34,1850,3
1203,1850-04-01,7.22,0.67,12.93,1.00,1.02,1.33,14.67,0.27,1850,4
1204,1850-05-01,10.00,0.62,15.65,2.41,3.81,1.35,15.51,0.25,1850,5

In [69]:
#dataset for every city to greece
gr_ath = gr[gr['City'] == 'Athens']
gr_thes = gr[gr['City'] =='Thessaloníki' ]
gr_lar = gr[gr['City'] == 'Lárisa']
gr_patra = gr[gr['City'] == 'Pátrai']

In [111]:
gr_ath

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month,temp_top,temp_bottom
460994,1753-01-01,8.77,5.13,Athens,Greece,37.78N,24.41E,1753,1,13.90,3.63
460995,1753-02-01,8.46,2.93,Athens,Greece,37.78N,24.41E,1753,2,11.39,5.53
460996,1753-03-01,12.95,2.76,Athens,Greece,37.78N,24.41E,1753,3,15.71,10.20
460997,1753-04-01,14.96,4.85,Athens,Greece,37.78N,24.41E,1753,4,19.80,10.11
460998,1753-05-01,20.14,2.03,Athens,Greece,37.78N,24.41E,1753,5,22.17,18.10
...,...,...,...,...,...,...,...,...,...,...,...
464117,2013-04-01,16.95,0.29,Athens,Greece,37.78N,24.41E,2013,4,17.24,16.66
464118,2013-05-01,21.99,0.41,Athens,Greece,37.78N,24.41E,2013,5,22.40,21.59
464119,2013-06-01,24.55,0.33,Athens,Greece,37.78N,24.41E,2013,6,24.88,24.22
464120,2013-07-01,26.79,0.27,Athens,Greece,37.78N,24.41E,2013,7,27.06,26.52
464121,2013-08-01,27.64,0.49,Athens,Greece,37.78N,24.41E,2013,8,28.13,27.15

In [113]:
gr_ath

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month,temp_top,temp_bottom
460994,1753-01-01,8.77,5.13,Athens,Greece,37.78N,24.41E,1753,1,13.90,3.63
460995,1753-02-01,8.46,2.93,Athens,Greece,37.78N,24.41E,1753,2,11.39,5.53
460996,1753-03-01,12.95,2.76,Athens,Greece,37.78N,24.41E,1753,3,15.71,10.20
460997,1753-04-01,14.96,4.85,Athens,Greece,37.78N,24.41E,1753,4,19.80,10.11
460998,1753-05-01,20.14,2.03,Athens,Greece,37.78N,24.41E,1753,5,22.17,18.10
...,...,...,...,...,...,...,...,...,...,...,...
464117,2013-04-01,16.95,0.29,Athens,Greece,37.78N,24.41E,2013,4,17.24,16.66
464118,2013-05-01,21.99,0.41,Athens,Greece,37.78N,24.41E,2013,5,22.40,21.59
464119,2013-06-01,24.55,0.33,Athens,Greece,37.78N,24.41E,2013,6,24.88,24.22
464120,2013-07-01,26.79,0.27,Athens,Greece,37.78N,24.41E,2013,7,27.06,26.52
464121,2013-08-01,27.64,0.49,Athens,Greece,37.78N,24.41E,2013,8,28.13,27.15

In [116]:
gr_ath_1 = gr_ath[gr_ath['month'] == 1 ]
ath_1 =gr_ath_1.sort_values('year', ascending = True)

In [115]:
ath_1 = ath_1[(ath_1['dt'] >= datetime(1970, 1, 1)) & (ath_1['dt'] <= datetime(2013, 1, 1))]
ath_1

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,year,month,temp_top,temp_bottom
463598,1970-01-01,12.10,0.25,Athens,Greece,37.78N,24.41E,1970,1,12.35,11.84
463610,1971-01-01,12.14,0.23,Athens,Greece,37.78N,24.41E,1971,1,12.37,11.91
463622,1972-01-01,10.04,0.24,Athens,Greece,37.78N,24.41E,1972,1,10.28,9.81
463634,1973-01-01,9.66,0.34,Athens,Greece,37.78N,24.41E,1973,1,10.01,9.32
463646,1974-01-01,8.86,0.33,Athens,Greece,37.78N,24.41E,1974,1,9.19,8.52
463658,1975-01-01,9.80,0.19,Athens,Greece,37.78N,24.41E,1975,1,9.99,9.62
463670,1976-01-01,10.28,0.25,Athens,Greece,37.78N,24.41E,1976,1,10.53,10.02
463682,1977-01-01,10.51,0.21,Athens,Greece,37.78N,24.41E,1977,1,10.72,10.31
463694,1978-01-01,9.93,0.26,Athens,Greece,37.78N,24.41E,1978,1,10.19,9.67
463706,1979-01-01,10.66,0.31,Athens,Greece,37.78N,24.41E,1979,1,10.98,10.35
463718,1980-01-01,9.39,0.23,Athens,Greece,37.78N,24.41E,1980,1,9.62,9.16
463730,1981-01-01,8.68,0.47,Athens,Greece,37.78N,24.41E,1981,1,9.15,8.20
463742,1982-01-01,10.86,0.21,Athens,Greece,37.78N,24.41E,1982,1,11.06,10.65
463754,1983-01-01,9.49,0.22,Athens,Greece,37.78N,24.41E,1983,1,9.72,9.27
463766,1984-01-01,11.47,0.29,Athens,Greece,37.78N,24.41E,1984,1,11.76,11.17
463778,1985-01-01,11.45,0.25,Athens,Greece,37.78N,24.41E,1985,1,11.70,11.20
463790,1986-01-01,11.84,0.22,Athens,Greece,37.78N,24.41E,1986,1,12.06,11.62
463802,1987-01-01,11.61,0.41,Athens,Greece,37.78N,24.41E,1987,1,12.02,11.20
463814,1988-01-01,11.70,0.25,Athens,Greece,37.78N,24.41E,1988,1,11.95,11.45
463826,1989-01-01,8.89,0.32,Athens,Greece,37.78N,24.41E,1989,1,9.21,8.58
463838,1990-01-01,9.17,0.26,Athens,Greece,37.78N,24.41E,1990,1,9.43,8.90
463850,1991-01-01,9.58,0.14,Athens,Greece,37.78N,24.41E,1991,1,9.72,9.44
463862,1992-01-01,9.30,0.34,Athens,Greece,37.78N,24.41E,1992,1,9.64,8.95
463874,1993-01-01,9.70,0.25,Athens,Greece,37.78N,24.41E,1993,1,9.95,9.45
463886,1994-01-01,11.96,0.32,Athens,Greece,37.78N,24.41E,1994,1,12.29,11.64
463898,1995-01-01,11.03,0.28,Athens,Greece,37.78N,24.41E,1995,1,11.31,10.74
463910,1996-01-01,9.76,0.22,Athens,Greece,37.78N,24.41E,1996,1,9.98,9.54
463922,1997-01-01,11.45,0.20,Athens,Greece,37.78N,24.41E,1997,1,11.65,11.25
463934,1998-01-01,10.74,0.22,Athens,Greece,37.78N,24.41E,1998,1,10.96,10.52
463946,1999-01-01,11.10,0.15,Athens,Greece,37.78N,24.41E,1999,1,11.24,10.95
463958,2000-01-01,8.15,0.25,Athens,Greece,37.78N,24.41E,2000,1,8.40,7.90
463970,2001-01-01,12.09,0.18,Athens,Greece,37.78N,24.41E,2001,1,12.27,11.91
463982,2002-01-01,9.25,0.28,Athens,Greece,37.78N,24.41E,2002,1,9.53,8.97
463994,2003-01-01,12.84,0.20,Athens,Greece,37.78N,24.41E,2003,1,13.04,12.64
464006,2004-01-01,9.59,0.39,Athens,Greece,37.78N,24.41E,2004,1,9.97,9.20
464018,2005-01-01,10.88,0.16,Athens,Greece,37.78N,24.41E,2005,1,11.04,10.72
464030,2006-01-01,8.36,0.30,Athens,Greece,37.78N,24.41E,2006,1,8.66,8.06
464042,2007-01-01,12.18,0.23,Athens,Greece,37.78N,24.41E,2007,1,12.41,11.94
464054,2008-01-01,9.87,0.19,Athens,Greece,37.78N,24.41E,2008,1,10.07,9.68
464066,2009-01-01,11.95,0.21,Athens,Greece,37.78N,24.41E,2009,1,12.15,11.74
464078,2010-01-01,11.51,0.23,Athens,Greece,37.78N,24.41E,2010,1,11.74,11.27
464090,2011-01-01,10.87,0.28,Athens,Greece,37.78N,24.41E,2011,1,11.14,10.59
464102,2012-01-01,8.35,0.34,Athens,Greece,37.78N,24.41E,2012,1,8.70,8.01
464114,2013-01-01,11.11,0.31,Athens,Greece,37.78N,24.41E,2013,1,11.42,10.79